app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE (G)  ORDER BY release_date
SELECT "movies".* FROM "movies" WHERE "rating"."R" = '1'  ORDER BY title
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('PG-13', 'R') AND "movies"."rating" IN ('PG-13', 'R')
---
  def index
    @movies = Movie.all
    @all_ratings = Movie.ratings # used to generate check boxes


    # if params is nil then look for value in the session
    @sort = params[:sort] ? params[:sort] : session[:sort]

    # if params is nil then look for value in the session
    @ratings = params[:ratings] ? params[:ratings] : session[:ratings]

    puts "-------------@sort = #{params[:sort]}"
    puts "-------------@ratings params = #{params[:ratings]}"
    puts "-------------@ratings session = #{session[:ratings]}"
    puts "-------------@ratings = #{@ratings.keys}"


    if !@sort.nil?
      @movies = @movies.order(@sort)
    end
    if !@ratings.nil?
      @movies = @movies.where({rating: @ratings.keys})