rottenpotatoes-rails-intro/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies"  ORDER BY release_date
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('PG-13', 'R') AND "movies"."rating" IN ('PG-13', 'R')
---
  def index
    @all_ratings = Movie.ratings

    @sort = params[:sort]
    @ratings = params[:ratings]
    if !@ratings.nil? then puts "----------- #{@ratings.keys}" end

    # if !@ratings.nil?
    #   # @all_ratings = @ratings.keys # find way to use this to check those boxes
    # end

    # @movies = Movie.where!({rating: @ratings.keys}).order(@sort)

    if !@sort.nil?
      @movies = Movie.order(@sort)
    end

    if !@ratings.nil?
      @movies.where!({rating: @ratings.keys})